In [16]:
import numpy as np
import pandas as pd

# Series TUtorial

In [17]:
labels = ['a', 'b', 'c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [18]:
pd.Series(my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [20]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [22]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [23]:
ser1 = pd.Series([1,2,3,4], index=['USA', 'CHINA', 'FRANCE', 'GERMANY'])

In [24]:
ser1

USA        1
CHINA      2
FRANCE     3
GERMANY    4
dtype: int64

In [25]:
ser2 = pd.Series([1,2,3,4], index=['USA', 'CHINA', 'ITALY', 'JAPAN'])

In [26]:
ser2

USA      1
CHINA    2
ITALY    3
JAPAN    4
dtype: int64

In [27]:
ser1['USA']

1

In [28]:
ser2['JAPAN']

4

In [29]:
ser1 + ser2

CHINA      4.0
FRANCE     NaN
GERMANY    NaN
ITALY      NaN
JAPAN      NaN
USA        2.0
dtype: float64

In [85]:
# Dataframe Tutorial
import numpy as pd
import pandas as pd
from numpy.random import randn

In [86]:
np.random.seed(101)

In [87]:
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [88]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [89]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [90]:
type(df['W'])

pandas.core.series.Series

In [91]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [98]:
df['new'] = df['W'] + df['Y']

In [100]:
df.drop('new',axis=1,inplace=True)

In [101]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df.shape

(5, 4)

In [103]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [104]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [105]:
df.loc['B','Y']

-0.8480769834036315